renesas/ra-fsp-examples/application_projects/r11an0901/RA_AWS_MQTT_TLS_Cloud_Connectivity_Solution_Cellular_RYZ024A/aws_ck_ra6m5_v2_cellular_ryz024a_app/src/ob1203_bio/ob1203_bio.c
/***********************************************************************************************************************
 * File Name    : ob1203_bio.c
 * Description  : Contains macros, data structures and functions for OB1203
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2023 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/

#include "ob1203_bio.h"
#include "hal_data.h"
#include "common_utils.h"

#define OB1203_BIO_TIMEOUT (10000) // 10s
#define OB1203_BIO_MAX_COUNTS (10)
#define OB1203_BIO_IR_LED_MAX_CURRENT (0x03FF)
#define OB1203_BIO_RED_LED_MAX_CURRENT (0x01FF)
#define OB1203_BIO_DEFAULT_TARGET_COUNTS (0x30000)
#define OB1203_BIO_PPG_RED_LED_DATA_THRESHOLD (8000)
#define OB1203_BIO_DEFAULT_WARM_UP_COUNTS (10)
#define OB1203_BIO_MAX_NUMBER_OF_SAMPLES_20 (20)
#define OB1203_BIO_OLDEST_IR_LED_POS (0)
#define OB1203_BIO_OLDEST_RED_LED_POS (1)
#define OB1203_BIO_MAX_TARGET_COUNTS (0x38000UL) // 220k
#define OB1203_BIO_MIN_TARGET_COUNTS (0xC000UL)  // 48k
#define OB1203_BIO_TOLERANCE_DEFAULT (6000)
#define OB1203_BIO_TOLERANCE_LOWEST_RANGE (0x5800UL)
#define OB1203_BIO_STEP (8)
#define OB1203_BIO_TOLERANCE_PERSIST (0x7530) // 30k counts ( < +/-2^15) -- so we can represent values as 18 bit data minus setpoint in int16_t
#define OB1203_BIO_IN_RANGE_PERSIST (4)
#define OB1203_BIO_SPO2_MAX_VALUE   (100)
#define OB1203_BIO_LOW_SIGNAL_THRESHOLD (0x4000) // Set to MIN_TARGET-2^16. Minimum biosensor ADC count. Below this sensor exits BIO mode and reverts to proximity sensor "wait for finger" mode
#define OB1203_BIO_DEFAULT_MAX_LOW_SAMPLES (20)
#define OB1203_BIO_PROX_PERSIST (0x02)

typedef enum e_ob1203_bio_callback_status
{
    OB1203_BIO_CALLBACK_STATUS_WAIT = (0),
    OB1203_BIO_CALLBACK_STATUS_SUCCESS,
    OB1203_BIO_CALLBACK_STATUS_REPEAT,
} ob1203_bio_callback_status_t;

static bool ob1203_bio_each_led_gain_current_control(ob1203_bio_t *const p_bio,
                                                     rm_ob1203_ppg_prox_gain_t *const p_gain,
                                                     uint16_t *const p_current,
                                                     uint32_t const ppg_data,
                                                     ob1203_led_target_counts_t *const p_target_counts,
                                                     ob1203_bio_led_type_t const led_type,
                                                     bool *const p_update);
static void ob1203_bio_i2c_callback_flag_clear(void);
static bool ob1203_bio_i2c_communication_success(void);
static void ob1203_bio_i2c_callback_wait(uint32_t delay_ms);
#if OB1203_BIO_IRQ_ENABLE
static void ob1203_bio_irq_callback_flag_clear(void);
static void ob1203_bio_irq_callback_wait(void);
#endif
static volatile ob1203_bio_callback_status_t gs_i2c_callback_status = OB1203_BIO_CALLBACK_STATUS_WAIT;
#if OB1203_BIO_IRQ_ENABLE
static volatile ob1203_bio_callback_status_t gs_irq_callback_status = OB1203_BIO_CALLBACK_STATUS_WAIT;
#endif
static const uint16_t gs_max_currents[OB1203_BIO_LED_MAX_NUM] =
{
        OB1203_BIO_IR_LED_MAX_CURRENT,
        OB1203_BIO_RED_LED_MAX_CURRENT,
};

/*******************************************************************************************************************//**
 * @brief               I2C bus of OB1203 sensor callback
 * @param[in]   p_args  OB1203 Callback function
 * @retval              None
 ***********************************************************************************************************************/
void ob1203_comms_i2c_callback(rm_ob1203_callback_args_t *p_args)
{
    if (RM_OB1203_EVENT_SUCCESS == p_args->event)
    {
        gs_i2c_callback_status = OB1203_BIO_CALLBACK_STATUS_SUCCESS;
    }
    else
    {
        gs_i2c_callback_status = OB1203_BIO_CALLBACK_STATUS_REPEAT;
    }
}

/*******************************************************************************************************************//**
 * @brief               OB1203 sensor callback
 * @param[in]   p_args  OB1203 Callback function
 * @retval              None
 ***********************************************************************************************************************/
void ob1203_irq_callback(rm_ob1203_callback_args_t *p_args)
{
#if OB1203_BIO_IRQ_ENABLE
    FSP_PARAMETER_NOT_USED(p_args);

    gs_irq_callback_status = OB1203_BIO_CALLBACK_STATUS_SUCCESS;
#else
    FSP_PARAMETER_NOT_USED(p_args);
#endif
}

/*******************************************************************************************************************//**
 * Open OB1203 sensor.
 *
 * @param      p_bio                  Ob1203_bio structure
 * @param[in]  p_prox_instance        Instance of prox mode
 * @param[in]  p_ppg_instance         Instance of ppg mode
 * @param[in]  p_spo2                 SPO2 structure
 * @retval     True                   Upon successful open OB1203 sensor
 * @retval     False                  Upon unsuccessful open OB1203 sensors
 **********************************************************************************************************************/
bool ob1203_bio_open(ob1203_bio_t *const p_bio,
                     rm_ob1203_instance_t *const p_prox_instance,
                     rm_ob1203_instance_t *const p_ppg_instance,
                     spo2_t *const p_spo2)
{
    /* Clear callback flags */
    ob1203_bio_i2c_callback_flag_clear();
#if OB1203_BIO_IRQ_ENABLE
    ob1203_bio_irq_callback_flag_clear();
#endif

    /* Set parameters */
    p_bio->p_prox_instance = p_prox_instance;
    p_bio->p_ppg_instance = p_ppg_instance;
    p_bio->mode = RM_OB1203_OPERATION_MODE_PROXIMITY;
    p_bio->mode_change = false;
    p_bio->low_signal_counts = OB1203_BIO_DEFAULT_MAX_LOW_SAMPLES;
    p_bio->p_spo2 = p_spo2;
    p_bio->data_check.threshold = OB1203_BIO_PPG_RED_LED_DATA_THRESHOLD;
    p_bio->data_check.warm_up = OB1203_BIO_DEFAULT_WARM_UP_COUNTS;
    p_bio->led_target_counts[OB1203_BIO_LED_TYPE_IR].target_counts = OB1203_BIO_DEFAULT_TARGET_COUNTS;
    p_bio->led_target_counts[OB1203_BIO_LED_TYPE_RED].target_counts = OB1203_BIO_DEFAULT_TARGET_COUNTS;
    p_bio->led_target_counts[OB1203_BIO_LED_TYPE_IR].in_range = false;
    p_bio->led_target_counts[OB1203_BIO_LED_TYPE_RED].in_range = false;
    p_bio->led_target_counts[OB1203_BIO_LED_TYPE_IR].in_range_persist = 0;
    p_bio->led_target_counts[OB1203_BIO_LED_TYPE_RED].in_range_persist = 0;
    p_bio->interrupt_cfg.prox_type = RM_OB1203_PROX_INTERRUPT_TYPE_NORMAL;
    p_bio->interrupt_cfg.persist = OB1203_BIO_PROX_PERSIST;
    p_bio->interrupt_cfg.ppg_type = RM_OB1203_PPG_INTERRUPT_TYPE_DATA;
    p_bio->prev_in_range = false;
    p_bio->target_counts_change = true;
    p_bio->algorithm_ready = false;

