renesas/ra-fsp-examples/application_projects/r11an0901/RA_AWS_MQTT_TLS_Cloud_Connectivity_Solution_Cellular_RYZ024A/aws_ck_ra6m5_v2_cellular_ryz024a_app/src/ob1203_bio/ob1203_bio.c
    /* Set the first instance to run */
    switch (p_bio->mode)
    {
        case RM_OB1203_OPERATION_MODE_PROXIMITY :
        {
            p_bio->p_instance = p_bio->p_prox_instance;
        }
        break;

        case RM_OB1203_OPERATION_MODE_PPG :
        {
            p_bio->p_instance = p_bio->p_ppg_instance;
        }
        break;

        default :
            return false;
    }

    /* Initialize the algorithm */
    spo2_init(p_bio->p_spo2);

    return true;
}

/*******************************************************************************************************************//**
 * Init OB1203 sensor in bio mode.
 *
 * @param      p_bio                  Ob1203_bio structure
 * @retval     True                   Upon successful Init OB1203 sensor's operation mode.
 * @retval     False                  Upon unsuccessful Init OB1203 sensor's operation mode.
 **********************************************************************************************************************/
bool ob1203_bio_operation_mode_init(ob1203_bio_t *const p_bio)
{
    fsp_err_t err;
    uint8_t counter;

    if (false != p_bio->mode_change)
    {
        /* Clear the flag */
        p_bio->mode_change = false;

        /* Close a previous instance */
        RM_OB1203_Close(p_bio->p_instance->p_ctrl);
    }

    /* Set the instance to run */
    switch (p_bio->mode)
    {
        case RM_OB1203_OPERATION_MODE_PROXIMITY :
        {
            p_bio->p_instance = p_bio->p_prox_instance;
        }
        break;

        case RM_OB1203_OPERATION_MODE_PPG :
        {
            p_bio->p_instance = p_bio->p_ppg_instance;
        }
        break;

        default :
            return false;
    }

    /* Open an instance */
    counter = OB1203_BIO_MAX_COUNTS;
    do
    {
        err = RM_OB1203_Open(p_bio->p_instance->p_ctrl, p_bio->p_instance->p_cfg);
        if (FSP_SUCCESS != err)
        {
        	APP_PRINT ("\r\nOB1203 sensor open fail \r\n");
            RM_OB1203_Close(p_bio->p_instance->p_ctrl);
        }
        /* Decrement */
        counter--;
    }
    while((FSP_SUCCESS != err) && (0 != counter));

    if (0 == counter)
    {
        return false;
    }

    return true;
}

/*******************************************************************************************************************//**
 * Start measurement for OB1203 sensor in bio mode.
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @retval     True                   Upon successful start measuring with OB1203 sensor
 * @retval     False                  Upon unsuccessful start measuring withOB1203 sensor
 **********************************************************************************************************************/
bool ob1203_bio_measurement_start(ob1203_bio_t *const p_bio)
{
    fsp_err_t err = FSP_SUCCESS;
    uint8_t counter;

#if OB1203_BIO_IRQ_ENABLE
    ob1203_bio_irq_callback_flag_clear();

    /* Set device interrupt configurations */
    counter = OB1203_BIO_MAX_COUNTS;
    do
    {
        ob1203_bio_i2c_callback_flag_clear();
        err = RM_OB1203_DeviceInterruptCfgSet(p_bio->p_instance->p_ctrl, p_bio->interrupt_cfg);
        if (FSP_SUCCESS != err)
        {
            return false;
        }
        ob1203_bio_i2c_callback_wait(OB1203_BIO_TIMEOUT);

        /* Decrement */
        counter--;
    } while ((false == ob1203_bio_i2c_communication_success()) && (0 != counter));

    if (0 == counter)
    {
        return false;
    }
#endif

    /* Start a measurement */
    counter = OB1203_BIO_MAX_COUNTS;
    do
    {
        ob1203_bio_i2c_callback_flag_clear();
        err = RM_OB1203_MeasurementStart(p_bio->p_instance->p_ctrl);
        if (FSP_SUCCESS != err)
        {
            return false;
        }
        ob1203_bio_i2c_callback_wait(OB1203_BIO_TIMEOUT);

        /* Decrement */
        counter--;
    } while ((false == ob1203_bio_i2c_communication_success()) && (0 != counter));

    if (0 == counter)
    {
        return false;
    }

    return true;
}

/*******************************************************************************************************************//**
 * Stop measurement for OB1203 sensor in bio mode.
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @retval     True                   Upon successful stop measuring OB1203 sensor
 * @retval     False                  Upon unsuccessful stop measuring OB1203 sensor
 **********************************************************************************************************************/
bool ob1203_bio_measurement_stop(ob1203_bio_t *const p_bio)
{
    fsp_err_t err = FSP_SUCCESS;
    uint8_t counter;

    /* Stop a measurement */
    counter = OB1203_BIO_MAX_COUNTS;
    do
    {
        ob1203_bio_i2c_callback_flag_clear();
        RM_OB1203_MeasurementStop(p_bio->p_instance->p_ctrl);
        if (FSP_SUCCESS != err)
        {
            return false;
        }
        ob1203_bio_i2c_callback_wait(OB1203_BIO_TIMEOUT);

        /* Decrement */
        counter--;
    } while ((false == ob1203_bio_i2c_communication_success()) && (0 != counter));

    if (0 == counter)
    {
        return false;
    }

    return true;
}

/*******************************************************************************************************************//**
 * Wait for measurement periodically for OB1203 sensor.
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @retval     True                   Upon successful waiting OB1203 sensor
 * @retval     False                  Upon unsuccessful waiting OB1203 sensor
 **********************************************************************************************************************/
bool ob1203_bio_measurement_period_wait(ob1203_bio_t *const p_bio)
{
#if OB1203_BIO_IRQ_ENABLE
    FSP_PARAMETER_NOT_USED(p_bio);
#else
    fsp_err_t err = FSP_SUCCESS;
    uint8_t counter;
    rm_ob1203_device_status_t device_status;
    bool * p_flag;
#endif

#if OB1203_BIO_IRQ_ENABLE

    /* Wait IRQ callback */
    ob1203_bio_irq_callback_wait();

    /* Clear the IRQ callback flag */
    ob1203_bio_irq_callback_flag_clear();
#else
    /* Wait until the measurement is completed */
    switch (p_bio->mode)
    {
        case RM_OB1203_OPERATION_MODE_PROXIMITY :
        {
            p_flag = &(device_status.prox_interrupt_occur);
        }
        break;

        case RM_OB1203_OPERATION_MODE_PPG :
        {
            if (RM_OB1203_PPG_INTERRUPT_TYPE_FIFO_AFULL == p_bio->interrupt_cfg.ppg_type)
            {
                p_flag = &(device_status.fifo_afull_interrupt_occur);
            }
            else
            {
                p_flag = &(device_status.ppg_measurement_complete);
            }
        }
        break;

        default :
            return false;
    }

    do
    {
        /* Get Device status */
        counter = OB1203_BIO_MAX_COUNTS;
        do
        {
            ob1203_bio_i2c_callback_flag_clear();
            err = RM_OB1203_DeviceStatusGet(p_bio->p_instance->p_ctrl, &device_status);
            if (FSP_SUCCESS != err)
            {
                return false;
            }
            ob1203_bio_i2c_callback_wait(OB1203_BIO_TIMEOUT);

            /* Decrement */
            counter--;
        } while ((false == ob1203_bio_i2c_communication_success()) && (0 != counter));

