renesas/ra-fsp-examples/application_projects/r11an0901/RA_AWS_MQTT_TLS_Cloud_Connectivity_Solution_Cellular_RYZ024A/aws_ck_ra6m5_v2_cellular_ryz024a_app/src/ob1203_bio/ob1203_bio.c
        if (0 == counter)
        {
            return false;
        }
    }
    while(false == *p_flag);
#endif

    return true;
}

/*******************************************************************************************************************//**
 * Read raw data of OB1203 sensor.
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param      p_raw_data             OB1203 raw data structure
 * @retval     True                   Upon successful reading of raw data with OB1203 sensor
 * @retval     False                  Upon unsuccessful reading of raw data with OB1203 sensor
 **********************************************************************************************************************/
bool ob1203_bio_ppg_raw_data_read(ob1203_bio_t *const p_bio, rm_ob1203_raw_data_t *const p_raw_data)
{
    fsp_err_t err = FSP_SUCCESS;
    uint8_t counter;
    rm_ob1203_fifo_info_t fifo_info;

    if (RM_OB1203_PPG_INTERRUPT_TYPE_FIFO_AFULL == p_bio->interrupt_cfg.ppg_type)
    {
        /* Get FIFO info */
        counter = OB1203_BIO_MAX_COUNTS;
        do
        {
            ob1203_bio_i2c_callback_flag_clear();
            err = RM_OB1203_FifoInfoGet(p_bio->p_instance->p_ctrl, &fifo_info);
            if (FSP_SUCCESS != err)
            {
                return false;
            }
            ob1203_bio_i2c_callback_wait(OB1203_BIO_TIMEOUT);

            /* Decrement */
            counter--;
        } while ((false == ob1203_bio_i2c_communication_success()) && (0 != counter));

        if (0 == counter)
        {
            return false;
        }

        /* Set overflow counter */
        p_bio->overflow = fifo_info.overflow_counter;

        p_bio->number_of_samples = OB1203_BIO_MAX_NUMBER_OF_SAMPLES_20;
    }
    else
    {
        /* Set overflow counter */
        p_bio->overflow = 0;

        /* Set number of samples */
        p_bio->number_of_samples = 2;
    }

    if (0 != p_bio->number_of_samples)
    {
        /* Read raw data */
        counter = OB1203_BIO_MAX_COUNTS;
        do
        {
            ob1203_bio_i2c_callback_flag_clear();
            err = RM_OB1203_PpgRead(p_bio->p_instance->p_ctrl, p_raw_data, p_bio->number_of_samples);
            if (FSP_SUCCESS != err)
            {
                return false;
            }
            ob1203_bio_i2c_callback_wait(OB1203_BIO_TIMEOUT);

            /* Decrement */
            counter--;
        } while ((false == ob1203_bio_i2c_communication_success()) && (0 != counter));

        if (0 == counter)
        {
            return false;
        }
    }

    return true;
}

/*******************************************************************************************************************//**
 * Calculate perfusion index with OB1203 sensor.
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param[in]  p_raw_data             OB1203 raw data structure
 * @param      p_ppg_data             OB1203 PPG data structure
 * @param      p_valid                Check OB1203 sensor data valid
 * @retval     True                   Upon successful perfusion index calculation with OB1203 sensor
 * @retval     False                  Upon unsuccessful perfusion index calculation with OB1203 sensor
 **********************************************************************************************************************/
bool ob1203_bio_ppg_data_calculate(ob1203_bio_t *const p_bio,
                                   rm_ob1203_raw_data_t *const p_raw_data,
                                   rm_ob1203_ppg_data_t *const p_ppg_data,
                                   bool *const p_valid)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Reset flag */
    *p_valid = false;

    if (0 != p_bio->number_of_samples)
    {
        /* Calculate PPG data from raw data */
        err = RM_OB1203_PpgDataCalculate(p_bio->p_instance->p_ctrl, p_raw_data, p_ppg_data);
        if (FSP_SUCCESS != err)
        {
            return false;
        }

        /* Set IR LED data for checking perfusion index (PI) */
        p_bio->ppg_data_for_pi = p_ppg_data->ppg_data[OB1203_BIO_OLDEST_IR_LED_POS];

        /* Check if the PPG value are above the threshold */
        if (p_bio->data_check.threshold <= p_ppg_data->ppg_data[OB1203_BIO_OLDEST_RED_LED_POS])
        {
            /* Check if warm up is completed */
            if (0 == p_bio->data_check.warm_up)
            {
                *p_valid = true;
            }
            else
            {
                p_bio->data_check.warm_up--;
            }
        }
        else
        {
            p_bio->data_check.warm_up = OB1203_BIO_DEFAULT_WARM_UP_COUNTS;
        }
    }

    /* Check if low signal */
    if (OB1203_BIO_LOW_SIGNAL_THRESHOLD > p_ppg_data->ppg_data[p_bio->number_of_samples - 2])
    {
        p_bio->low_signal_counts--;
        if (0 == p_bio->low_signal_counts)
        {
            p_bio->low_signal_counts = OB1203_BIO_DEFAULT_MAX_LOW_SAMPLES;
            p_bio->mode_change = true;
            *p_valid = false;
        }
    }
    else
    {
        p_bio->low_signal_counts = OB1203_BIO_DEFAULT_MAX_LOW_SAMPLES;
    }

    return true;
}

/*******************************************************************************************************************//**
 * Auto gain and currents control for OB1203 sensor
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param[in]  p_ppg_data             OB1203 PPG data structure
 * @param      p_gain_currents        ob1203_bio_gain_currents structure
 * @param      p_update               Flag to check the update
 * @retval     True                   Auto gain and currents control successfully
 * @retval     False                  Auto gain and currents control unsuccessfully
 **********************************************************************************************************************/
bool ob1203_bio_auto_gain_currents_control(ob1203_bio_t *const p_bio,
                                           rm_ob1203_ppg_data_t *const p_ppg_data,
                                           ob1203_bio_gain_currents_t *const p_gain_currents,
                                           bool *const p_update)
{
    bool result = true;
    bool ir_update = false;
    bool red_update = false;

    /* Reset flag */
    *p_update = false;

