renesas/ra-fsp-examples/application_projects/r11an0901/RA_AWS_MQTT_TLS_Cloud_Connectivity_Solution_Cellular_RYZ024A/aws_ck_ra6m5_v2_cellular_ryz024a_app/src/ob1203_bio/ob1203_bio.c
    /* Check if samples have one pair or more */
    if (2 <= p_bio->number_of_samples)
    {
        /* IR LED */
        result = ob1203_bio_each_led_gain_current_control(p_bio,
                                                          NULL,
                                                          &p_gain_currents->currents.ir_led,
                                                          p_ppg_data->ppg_data[p_bio->number_of_samples - 2],
                                                          &p_bio->led_target_counts[OB1203_BIO_LED_TYPE_IR],
                                                          OB1203_BIO_LED_TYPE_IR,
                                                          &ir_update);
        if (false == result)
        {
            return false;
        }

        /* Red LED */
        result = ob1203_bio_each_led_gain_current_control(p_bio,
                                                          &p_gain_currents->gain.ppg_prox,
                                                          &p_gain_currents->currents.red_led,
                                                          p_ppg_data->ppg_data[p_bio->number_of_samples - 1],
                                                          &p_bio->led_target_counts[OB1203_BIO_LED_TYPE_RED],
                                                          OB1203_BIO_LED_TYPE_RED,
                                                          &red_update);
        if (false == result)
        {
            return false;
        }

        if ((false != ir_update) || (false != red_update))
        {
            /* Set the flag */
            *p_update = true;
        }
    }
    else
    {
        return false;
    }

    return true;
}

/*******************************************************************************************************************//**
 * Control led gain current of OB1203 sensor
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param[in]  p_ppg_data             OB1203 PPG data structure
 * @param[in]  led_type
 * @param      p_gain                 PPG and proximity gain range        
 * @param      p_current   
 * @param      p_target_counts           
 * @param      p_update               Flag to check the update
 * @retval     True                   Control led gain current of OB1203 sensor successfully
 **********************************************************************************************************************/
static bool ob1203_bio_each_led_gain_current_control(ob1203_bio_t *const p_bio,
                                                     rm_ob1203_ppg_prox_gain_t *const p_gain,
                                                     uint16_t *const p_current,
                                                     uint32_t const ppg_data,
                                                     ob1203_led_target_counts_t *const p_target_counts,
                                                     ob1203_bio_led_type_t const led_type,
                                                     bool *const p_update)
{
    uint32_t tolerance = OB1203_BIO_TOLERANCE_DEFAULT;
    uint32_t tolerance_tmp;
    uint32_t step_change; // How much the counts will change with one step of the current
    uint32_t tmp_u32;
    uint16_t tmp_u16;

    /* Clear flag */
    *p_update = false;

    /* Set tolerance */
    if (OB1203_BIO_MIN_TARGET_COUNTS == p_target_counts->target_counts)
    {
        /* Allow the signal to be +/=22k from from target counts in the lowest range */
        tolerance = OB1203_BIO_TOLERANCE_LOWEST_RANGE;
    }
    else
    {
        /* Set the tolerance to be the step size at the current target counts */
        step_change = (uint32_t)(OB1203_BIO_STEP * p_target_counts->target_counts) / (uint32_t)*p_current;

        if (OB1203_BIO_TOLERANCE_DEFAULT > step_change)
        {
            tolerance = OB1203_BIO_TOLERANCE_DEFAULT;
        }
        else if (OB1203_BIO_TOLERANCE_LOWEST_RANGE < step_change)
        {
            tolerance = OB1203_BIO_TOLERANCE_LOWEST_RANGE; // Constrain
        }
        else
        {
            tolerance = step_change;
        }
    }

    /* When target counts persist in range */
    if (OB1203_BIO_IN_RANGE_PERSIST < p_target_counts->in_range_persist)
    {
        tolerance_tmp = OB1203_BIO_TOLERANCE_PERSIST;
    }
    else
    {
        tolerance_tmp = tolerance;
    }

    if (ppg_data < (p_target_counts->target_counts - tolerance_tmp)) // Too low case
    {
        if (OB1203_BIO_TOLERANCE_PERSIST == tolerance_tmp)
        {
            /* Out of range */
            p_target_counts->in_range_persist = 0;
        }

        if (gs_max_currents[led_type] > *p_current + OB1203_BIO_STEP)
        {
            *p_current += OB1203_BIO_STEP;
            *p_update = true;
        }
        else // Current is close to max.
        {
            tmp_u32 = (p_target_counts->target_counts * 9) / 10;
            if (OB1203_BIO_MIN_TARGET_COUNTS < tmp_u32)
            {
                /* Decrease target counts */
                p_target_counts->target_counts = tmp_u32;
                p_bio->target_counts_change = true;
            }
            else if (OB1203_BIO_MIN_TARGET_COUNTS == p_target_counts->target_counts)
            {
                /* Increase gain */
                if ((NULL != p_gain) && (OB1203_BIO_LED_TYPE_RED == led_type))
                {
                    switch (*p_gain)
                    {
                    case RM_OB1203_PPG_PROX_GAIN_1:
                    {
                        *p_gain = RM_OB1203_PPG_PROX_GAIN_1P5;
                        *p_update = true;
                    }
                    break;

                    case RM_OB1203_PPG_PROX_GAIN_1P5:
                    {
                        *p_gain = RM_OB1203_PPG_PROX_GAIN_2;
                        *p_update = true;
                    }
                    break;

                    case RM_OB1203_PPG_PROX_GAIN_2:
                    {
                        *p_gain = RM_OB1203_PPG_PROX_GAIN_4;
                        *p_update = true;
                    }
                    break;

                    case RM_OB1203_PPG_PROX_GAIN_4:
                    default:
                    {
                    }
                    break;
                    }
                }
            }
            else
            {
                p_target_counts->target_counts = OB1203_BIO_MIN_TARGET_COUNTS;
                p_bio->target_counts_change = true;
            }

            p_target_counts->in_range_persist = 0;
        }
    }
    else if (ppg_data > (p_target_counts->target_counts + tolerance_tmp)) // Too high case
    {
        if (OB1203_BIO_TOLERANCE_PERSIST == tolerance_tmp)
        {
            /* Out of range */
            p_target_counts->in_range_persist = 0;
        }

        if ((NULL != p_gain) && (OB1203_BIO_LED_TYPE_RED == led_type))
        {
            /* Decrease gain */
            switch (*p_gain)
            {
            case RM_OB1203_PPG_PROX_GAIN_1P5:
            {
                tmp_u32 = (OB1203_BIO_MIN_TARGET_COUNTS * 15) / 8;
                if (ppg_data > tmp_u32)
                {
                    *p_gain = RM_OB1203_PPG_PROX_GAIN_1;
                    *p_update = true;
                    p_target_counts->in_range_persist = 0;
                }
            }
            break;

            case RM_OB1203_PPG_PROX_GAIN_2:
            {
                tmp_u32 = (OB1203_BIO_MIN_TARGET_COUNTS * 3) / 2;
                if (ppg_data > tmp_u32)
                {
                    *p_gain = RM_OB1203_PPG_PROX_GAIN_1P5;
                    *p_update = true;
                    p_target_counts->in_range_persist = 0;
                }
            }
            break;

            case RM_OB1203_PPG_PROX_GAIN_4:
            {
                tmp_u32 = (OB1203_BIO_MIN_TARGET_COUNTS * 5) / 2;
                if (ppg_data > tmp_u32)
                {
                    *p_gain = RM_OB1203_PPG_PROX_GAIN_1P5;
                    *p_update = true;
                    p_target_counts->in_range_persist = 0;
                }
            }
            break;

