renesas/ra-fsp-examples/application_projects/r11an0901/RA_AWS_MQTT_TLS_Cloud_Connectivity_Solution_Cellular_RYZ024A/aws_ck_ra6m5_v2_cellular_ryz024a_app/src/ob1203_bio/ob1203_bio.c
            case RM_OB1203_PPG_PROX_GAIN_1:
            default:
            {
            }
            break;
            }

            if (false == *p_update) // Gain cannot be changed
            {
                /* Change target counts */
                tmp_u16 = (uint16_t)((*p_current * 9) / 8);
                tmp_u32 = (p_target_counts->target_counts * 10) / 9;
                if ((gs_max_currents[led_type] > tmp_u16) && (OB1203_BIO_MAX_TARGET_COUNTS > tmp_u32))
                {
                    p_target_counts->target_counts = tmp_u32;
                    p_bio->target_counts_change = true;
                }
                else
                {
                    /* Decrease current value */
                    if ((2 * OB1203_BIO_STEP) < *p_current)
                    {
                        *p_current -= OB1203_BIO_STEP;
                        *p_update = true;
                    }
                }
            }
        }
        else
        {
            /* Increase target counts */
            tmp_u16 = (uint16_t)((*p_current * 9) / 8);
            tmp_u32 = (p_target_counts->target_counts * 10) / 9;
            if ((gs_max_currents[led_type] > tmp_u16) && (OB1203_BIO_MAX_TARGET_COUNTS > tmp_u32))
            {
                p_target_counts->target_counts = tmp_u32;
                p_bio->target_counts_change = true;
            }
            else
            {
                /* Decrease current value */
                if ((2 * OB1203_BIO_STEP) < *p_current)
                {
                    *p_current -= OB1203_BIO_STEP;
                    *p_update = true;
                }
            }
        }
    }
    else // Just right
    {
        if ((ppg_data > (p_target_counts->target_counts - tolerance)) &&
            (ppg_data < (p_target_counts->target_counts + tolerance)))
        {
            if (OB1203_BIO_IN_RANGE_PERSIST >= p_target_counts->in_range_persist)
            {
                p_target_counts->in_range_persist++;
            }
        }
    }

    /* Check if target counts is in range */
    if (OB1203_BIO_IN_RANGE_PERSIST < p_target_counts->in_range_persist)
    {
        p_target_counts->in_range = true;
    }
    else
    {
        p_target_counts->in_range = false;
    }

    return true;
}

/*******************************************************************************************************************//**
 * Reconfigure gain currents
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param      p_gain_currents        ob1203_bio_gain_currents structure
 * @retval     True                   Reconfigure gain currents successfully
 * @retval     False                  Reconfigure gain currents unsuccessfully
 **********************************************************************************************************************/
bool ob1203_bio_gain_currents_reconfigure(ob1203_bio_t *const p_bio, ob1203_bio_gain_currents_t *const p_gain_currents)
{
    fsp_err_t err = FSP_SUCCESS;
    uint8_t counter;

    /* Set Gain */
    counter = OB1203_BIO_MAX_COUNTS;
    do
    {
        ob1203_bio_i2c_callback_flag_clear();
        err = RM_OB1203_GainSet(p_bio->p_instance->p_ctrl, p_gain_currents->gain);
        if (FSP_SUCCESS != err)
        {
            return false;
        }
        ob1203_bio_i2c_callback_wait(OB1203_BIO_TIMEOUT);

        /* Decrement */
        counter--;
    } while ((false == ob1203_bio_i2c_communication_success()) && (0 != counter));

    if (0 == counter)
    {
        return false;
    }

    /* Set Currents */
    counter = OB1203_BIO_MAX_COUNTS;
    do
    {
        ob1203_bio_i2c_callback_flag_clear();
        err = RM_OB1203_LedCurrentSet(p_bio->p_instance->p_ctrl, p_gain_currents->currents);
        if (FSP_SUCCESS != err)
        {
            return false;
        }
        ob1203_bio_i2c_callback_wait(OB1203_BIO_TIMEOUT);

        /* Decrement */
        counter--;
    } while ((false == ob1203_bio_i2c_communication_success()) && (0 != counter));

    if (0 == counter)
    {
        return false;
    }

    /* Set Device interrupt configurations */
    p_bio->interrupt_cfg.ppg_type = RM_OB1203_PPG_INTERRUPT_TYPE_DATA;

    return true;
}

/*******************************************************************************************************************//**
 * Check status of the preparation for the algorithm
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param      p_ready                status of the preparation for the algorithm
 * @retval     True                   Check perfusion index successfully
 **********************************************************************************************************************/
bool ob1203_bio_algorithm_preparation_check(ob1203_bio_t *const p_bio, bool *const p_ready)
{
    /* Clear flag */
    *p_ready = false;

    /* Check if previous counts were in range */
    if (false == p_bio->prev_in_range)
    {
        /* Check if both counts are in range */
        if ((false != p_bio->led_target_counts[OB1203_BIO_LED_TYPE_IR].in_range) &&
            (false != p_bio->led_target_counts[OB1203_BIO_LED_TYPE_RED].in_range))
        {
            /* Check device interrupt type */
            if (RM_OB1203_PPG_INTERRUPT_TYPE_DATA == p_bio->interrupt_cfg.ppg_type)
            {
                /* Set Device interrupt configurations */
                p_bio->interrupt_cfg.ppg_type = RM_OB1203_PPG_INTERRUPT_TYPE_FIFO_AFULL;
            }
            else
            {
                /* Check if target counts change */
                if (false != p_bio->target_counts_change)
                {
                    p_bio->target_counts_change = false;
                }
                else
                {
                    p_bio->prev_in_range = true;
                    *p_ready = true;
                }
            }
        }
    }
    else
    {
        if ((false == p_bio->led_target_counts[OB1203_BIO_LED_TYPE_IR].in_range) ||
            (false == p_bio->led_target_counts[OB1203_BIO_LED_TYPE_RED].in_range))
        {
            /* Set Device interrupt configurations */
            p_bio->interrupt_cfg.ppg_type = RM_OB1203_PPG_INTERRUPT_TYPE_DATA;
            p_bio->prev_in_range = false;
        }
        else
        {
            *p_ready = true;
        }
    }

