renesas/ra-fsp-examples/application_projects/r11an0901/RA_AWS_MQTT_TLS_Cloud_Connectivity_Solution_Cellular_RYZ024A/aws_ck_ra6m5_v2_cellular_ryz024a_app/src/ob1203_bio/ob1203_bio.c
    return true;
}

/*******************************************************************************************************************//**
 * Check if an operation mode needs to be changed
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param      p_change               Assign to true if the operation mode needs to be changed
 * @retval     True                   Check successfully
 * @retval     False                  Check unsuccessfully
 **********************************************************************************************************************/
bool ob1203_bio_mode_change_check(ob1203_bio_t *const p_bio, bool *const p_change)
{
    /* Clear flag */
    *p_change = false;

    switch (p_bio->mode)
    {
        case RM_OB1203_OPERATION_MODE_PROXIMITY :
        {
            p_bio->mode = RM_OB1203_OPERATION_MODE_PPG;
            p_bio->interrupt_cfg.ppg_type = RM_OB1203_PPG_INTERRUPT_TYPE_DATA;
            p_bio->mode_change = true;
            *p_change = true;
        }
        break;

        case RM_OB1203_OPERATION_MODE_PPG :
        {
            if (false != p_bio->mode_change)
            {
                p_bio->mode = RM_OB1203_OPERATION_MODE_PROXIMITY;
                p_bio->interrupt_cfg.prox_type = RM_OB1203_PROX_INTERRUPT_TYPE_NORMAL;
                p_bio->interrupt_cfg.persist = OB1203_BIO_PROX_PERSIST;
                *p_change = true;
            }
        }
        break;

        default :
            return false;
    }

    return true;
}

/*******************************************************************************************************************//**
 * Add ppg samples
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param[in]  p_ppg_data             OB1203 PPG data structure
 * @retval     True                   Add ppg samples successfully
 **********************************************************************************************************************/
bool ob1203_bio_samples_add(ob1203_bio_t *const p_bio, rm_ob1203_ppg_data_t *const p_ppg_data)
{
    spo2_target_counts_t target_counts;
    uint32_t i;
    uint32_t length;

    /* Set target counts */
    target_counts.ir_led  = p_bio->led_target_counts[OB1203_BIO_LED_TYPE_IR].target_counts;
    target_counts.red_led = p_bio->led_target_counts[OB1203_BIO_LED_TYPE_RED].target_counts;

    /* Add oldest samples to deal with missing (overwritten) samples */
    length = (uint32_t)(p_bio->overflow >> 1);
    for (i = 0; i < length; i++)
    {
        add_sample(p_bio->p_spo2,
                   target_counts,
                   p_ppg_data->ppg_data[OB1203_BIO_OLDEST_IR_LED_POS],
                   p_ppg_data->ppg_data[OB1203_BIO_OLDEST_RED_LED_POS]);

        /* Increment missed counts */
        missed_sample_counts_increment(p_bio->p_spo2);
    }

    /* Add samples */
    length = (uint32_t)(p_bio->number_of_samples >> 1);
    for (i = 0; i < length; i++)
    {
        add_sample(p_bio->p_spo2,
                   target_counts,
                   p_ppg_data->ppg_data[2 * i],
                   p_ppg_data->ppg_data[2 * i + 1]);

        /* Increment read counts */
        read_sample_counts_increment(p_bio->p_spo2);
    }

    /* Set a flag for the algorithm */
    p_bio->algorithm_ready = true;

    return true;
}

/*******************************************************************************************************************//**
 * Clear ppg samples
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @retval     True                   Clear ppg samples successfully
 **********************************************************************************************************************/
bool ob1203_bio_samples_clear(ob1203_bio_t *const p_bio)
{
    /* Clear counts of samples */
    counts_of_samples_clear(p_bio->p_spo2);

    /* Clear a flag for the algorithm */
    p_bio->algorithm_ready = false;

    return true;
}

/*******************************************************************************************************************//**
 * Reset the algorithm
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @retval     True                   Reset the algorithm successfully
 **********************************************************************************************************************/
bool ob1203_bio_algorithm_reset(ob1203_bio_t *const p_bio)
{
    /* Reset the algorithm */
    spo2_reset(p_bio->p_spo2);

    return true;
}

/*******************************************************************************************************************//**
 * Calculate heart rate and SpO2 values
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param[in]  p_bio_data             Ob1203_bio_data structure
 * @retval     True                   Calculate heart rate and SpO2 values successfully
 * @retval     False                  Calculate heart rate and SpO2 values unsuccessfully
 **********************************************************************************************************************/
bool ob1203_bio_hr_spo2_calculate(ob1203_bio_t *const p_bio, ob1203_bio_data_t *const p_bio_data)
{
    bool result = true;
    spo2_target_counts_t target_counts;

    if (false != p_bio->algorithm_ready)
    {
        /* Set target counts */
        target_counts.ir_led  = p_bio->led_target_counts[OB1203_BIO_LED_TYPE_IR].target_counts;
        target_counts.red_led = p_bio->led_target_counts[OB1203_BIO_LED_TYPE_RED].target_counts;

        /* Calculate heart rate and SpO2 by the algorithm */
        hr_and_spo2_calculate(p_bio->p_spo2,
                              &p_bio_data->heart_rate,
                              &p_bio_data->spo2,
                              &p_bio_data->perfusion_index,
                              target_counts);
        if (false == result)
        {
            return false;
        }
    }

    return true;
}

/*******************************************************************************************************************//**
 * Calculate a respiration rate value
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param[in]  p_bio_data             Ob1203_bio_data structure
 * @retval     True                   Calculate heart rate and SpO2 values successfully
 **********************************************************************************************************************/
bool ob1203_bio_rr_calculate(ob1203_bio_t *const p_bio, ob1203_bio_data_t *const p_bio_data)
{
    if (false != p_bio->algorithm_ready)
    {
        /* Calculate respiration rate by the algorithm */
        rr_calculate(p_bio->p_spo2, &p_bio_data->respiration_rate);
    }

