renesas/ra-fsp-examples/application_projects/r11an0901/RA_AWS_MQTT_TLS_Cloud_Connectivity_Solution_Cellular_RYZ024A/aws_ck_ra6m5_v2_cellular_ryz024a_app/src/ob1203_bio/ob1203_bio.c
    return true;
}

/*******************************************************************************************************************//**
 * Check perfusion index
 *
 * @param[in]  p_bio                  Ob1203_bio structure
 * @param      p_valid                Check OB1203 sensor data valid
 * @retval     True                   Check perfusion index successfully
 **********************************************************************************************************************/
bool ob1203_bio_perfusion_index_check(ob1203_bio_t *const p_bio, bool * const p_valid)
{
    if (false != p_bio->algorithm_ready)
    {
        /* Check perfusion index (PI) */
        check_pi(p_bio->p_spo2, p_bio->ppg_data_for_pi, p_valid);
    }

    return true;
}

/*******************************************************************************************************************//**
 * Clear i2c callback flags
 *
 * @param      None
 * @retval     None
 **********************************************************************************************************************/
static void ob1203_bio_i2c_callback_flag_clear(void)
{
    /* Clear status */
    gs_i2c_callback_status = OB1203_BIO_CALLBACK_STATUS_WAIT;
}


/*******************************************************************************************************************//**
 * Check I2C communication of OB1203 sensor
 *
 * @param      None
 * @retval     True         I2C Communication successfully
 * @retval     False        I2C Communication unsuccessfully
 **********************************************************************************************************************/
static bool ob1203_bio_i2c_communication_success(void)
{
    if (OB1203_BIO_CALLBACK_STATUS_SUCCESS == gs_i2c_callback_status)
    {
        return true;
    }
    else
    {
        return false;
    }
}

/*******************************************************************************************************************//**
 * ob1203_bio_i2c_callback_wait function
 *
 * @param[in]  timeout_ms   
 * @retval     None
 **********************************************************************************************************************/
static void ob1203_bio_i2c_callback_wait(uint32_t const timeout_ms)
{
    uint32_t counter = timeout_ms;

    while (OB1203_BIO_CALLBACK_STATUS_WAIT == gs_i2c_callback_status)
    {
        if (0 == counter)
        {
            break;
        }

        /* Decrement */
        counter--;
    }
}

#if OB1203_BIO_IRQ_ENABLE
/*******************************************************************************************************************//**
 * Clear the IRQ callback flag
 *
 * @param      None 
 * @retval     None
 **********************************************************************************************************************/
static void ob1203_bio_irq_callback_flag_clear(void)
{
    /* Clear status */
    gs_irq_callback_status = OB1203_BIO_CALLBACK_STATUS_WAIT;
}

/*******************************************************************************************************************//**
 * ob1203_bio_irq_callback_wait function
 *
 * @param      None 
 * @retval     None
 **********************************************************************************************************************/
static void ob1203_bio_irq_callback_wait()
{
    while (OB1203_BIO_CALLBACK_STATUS_WAIT == gs_irq_callback_status)
    {
        vTaskDelay(1);
    }
}
#endif
